fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <posting>Deny</posting>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПревышениеДней</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда 
		ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Параметры.Адрес);
		Если ТипЗнч(ОтпускаСотрудников) = Тип("ТаблицаЗначений") Тогда
			ЗаполнитьДиаграмму(ОтпускаСотрудников);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграмму(ОтпускаСотрудников)
	
	Графики.Обновление = Ложь;
	Графики.Очистить();

	ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
	
	Серия = Графики.УстановитьСерию(ВидРасчета);
	Серия.Текст = ВидРасчета; 

	Для Каждого ОтпускСотрудника Из ОтпускаСотрудников Цикл
		
		Точка = Графики.УстановитьТочку(ОтпускСотрудника.Сотрудник);
		Точка.Текст = ОтпускСотрудника.Сотрудник;
		
		Значение = Графики.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = ОтпускСотрудника.ДатаНачала;
		Интервал.Конец = ОтпускСотрудника.ДатаОкончания;
		
	КонецЦикла;

	Графики.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
